/* automatically generated by rust-bindgen */

pub const _VCRT_COMPILER_PREPROCESSOR: u32 = 1;
pub const _SAL_VERSION: u32 = 20;
pub const __SAL_H_VERSION: u32 = 180000000;
pub const _USE_DECLSPECS_FOR_SAL: u32 = 0;
pub const _USE_ATTRIBUTES_FOR_SAL: u32 = 0;
pub const _CRT_PACKING: u32 = 8;
pub const _HAS_EXCEPTIONS: u32 = 1;
pub const _HAS_CXX17: u32 = 0;
pub const _HAS_CXX20: u32 = 0;
pub const _HAS_NODISCARD: u32 = 0;
pub const WCHAR_MIN: u32 = 0;
pub const WCHAR_MAX: u32 = 65535;
pub const WINT_MIN: u32 = 0;
pub const WINT_MAX: u32 = 65535;
pub const WINAPI_FAMILY_PC_APP: u32 = 2;
pub const WINAPI_FAMILY_PHONE_APP: u32 = 3;
pub const WINAPI_FAMILY_SYSTEM: u32 = 4;
pub const WINAPI_FAMILY_SERVER: u32 = 5;
pub const WINAPI_FAMILY_DESKTOP_APP: u32 = 100;
pub const WINAPI_FAMILY_APP: u32 = 2;
pub const WINAPI_FAMILY: u32 = 100;
pub const GL_VERSION_1_1: u32 = 1;
pub const GL_ACCUM: u32 = 256;
pub const GL_LOAD: u32 = 257;
pub const GL_RETURN: u32 = 258;
pub const GL_MULT: u32 = 259;
pub const GL_ADD: u32 = 260;
pub const GL_NEVER: u32 = 512;
pub const GL_LESS: u32 = 513;
pub const GL_EQUAL: u32 = 514;
pub const GL_LEQUAL: u32 = 515;
pub const GL_GREATER: u32 = 516;
pub const GL_NOTEQUAL: u32 = 517;
pub const GL_GEQUAL: u32 = 518;
pub const GL_ALWAYS: u32 = 519;
pub const GL_CURRENT_BIT: u32 = 1;
pub const GL_POINT_BIT: u32 = 2;
pub const GL_LINE_BIT: u32 = 4;
pub const GL_POLYGON_BIT: u32 = 8;
pub const GL_POLYGON_STIPPLE_BIT: u32 = 16;

#[doc = " @brief The function pointer type for monitor configuration callbacks."]
#[doc = ""]
#[doc = "  This is the function pointer type for monitor configuration callbacks."]
#[doc = "  A monitor callback function has the following signature:"]
#[doc = "  @code"]
#[doc = "  void function_name(GLFWmonitor* monitor, int event)"]
#[doc = "  @endcode"]
#[doc = ""]
#[doc = "  @param[in] monitor The monitor that was connected or disconnected."]
#[doc = "  @param[in] event One of `GLFW_CONNECTED` or `GLFW_DISCONNECTED`.  Future"]
#[doc = "  releases may add more events."]
#[doc = ""]
#[doc = "  @sa @ref monitor_event"]
#[doc = "  @sa @ref glfwSetMonitorCallback"]
#[doc = ""]
#[doc = "  @since Added in version 3.0."]
#[doc = ""]
#[doc = "  @ingroup monitor"]
pub type GLFWmonitorfun = ::std::option::Option<
    unsafe extern "C" fn(arg1: *mut GLFWmonitor, arg2: ::std::os::raw::c_int),
>;
#[doc = " @brief The function pointer type for joystick configuration callbacks."]
#[doc = ""]
#[doc = "  This is the function pointer type for joystick configuration callbacks."]
#[doc = "  A joystick configuration callback function has the following signature:"]
#[doc = "  @code"]
#[doc = "  void function_name(int jid, int event)"]
#[doc = "  @endcode"]
#[doc = ""]
#[doc = "  @param[in] jid The joystick that was connected or disconnected."]
#[doc = "  @param[in] event One of `GLFW_CONNECTED` or `GLFW_DISCONNECTED`.  Future"]
#[doc = "  releases may add more events."]
#[doc = ""]
#[doc = "  @sa @ref joystick_event"]
#[doc = "  @sa @ref glfwSetJoystickCallback"]
#[doc = ""]
#[doc = "  @since Added in version 3.2."]
#[doc = ""]
#[doc = "  @ingroup input"]
pub type GLFWjoystickfun = ::std::option::Option<
    unsafe extern "C" fn(arg1: ::std::os::raw::c_int, arg2: ::std::os::raw::c_int),
>;
#[doc = " @brief Video mode type."]
#[doc = ""]
#[doc = "  This describes a single video mode."]
#[doc = ""]
#[doc = "  @sa @ref monitor_modes"]
#[doc = "  @sa @ref glfwGetVideoMode"]
#[doc = "  @sa @ref glfwGetVideoModes"]
#[doc = ""]
#[doc = "  @since Added in version 1.0."]
#[doc = "  @glfw3 Added refresh rate member."]
#[doc = ""]
#[doc = "  @ingroup monitor"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GLFWvidmode {
    #[doc = " The width, in screen coordinates, of the video mode."]
    pub width: ::std::os::raw::c_int,
    #[doc = " The height, in screen coordinates, of the video mode."]
    pub height: ::std::os::raw::c_int,
    #[doc = " The bit depth of the red channel of the video mode."]
    pub redBits: ::std::os::raw::c_int,
    #[doc = " The bit depth of the green channel of the video mode."]
    pub greenBits: ::std::os::raw::c_int,
    #[doc = " The bit depth of the blue channel of the video mode."]
    pub blueBits: ::std::os::raw::c_int,
    #[doc = " The refresh rate, in Hz, of the video mode."]
    pub refreshRate: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_GLFWvidmode() {
    assert_eq!(
        ::std::mem::size_of::<GLFWvidmode>(),
        24usize,
        concat!("Size of: ", stringify!(GLFWvidmode))
    );
    assert_eq!(
        ::std::mem::align_of::<GLFWvidmode>(),
        4usize,
        concat!("Alignment of ", stringify!(GLFWvidmode))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GLFWvidmode>())).width as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GLFWvidmode),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GLFWvidmode>())).height as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(GLFWvidmode),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GLFWvidmode>())).redBits as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GLFWvidmode),
            "::",
            stringify!(redBits)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GLFWvidmode>())).greenBits as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(GLFWvidmode),
            "::",
            stringify!(greenBits)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GLFWvidmode>())).blueBits as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(GLFWvidmode),
            "::",
            stringify!(blueBits)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GLFWvidmode>())).refreshRate as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(GLFWvidmode),
            "::",
            stringify!(refreshRate)
        )
    );
}
#[doc = " @brief Gamma ramp."]
#[doc = ""]
#[doc = "  This describes the gamma ramp for a monitor."]
#[doc = ""]
#[doc = "  @sa @ref monitor_gamma"]
#[doc = "  @sa @ref glfwGetGammaRamp"]
#[doc = "  @sa @ref glfwSetGammaRamp"]
#[doc = ""]
#[doc = "  @since Added in version 3.0."]
#[doc = ""]
#[doc = "  @ingroup monitor"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GLFWgammaramp {
    #[doc = " An array of value describing the response of the red channel."]
    pub red: *mut ::std::os::raw::c_ushort,
    #[doc = " An array of value describing the response of the green channel."]
    pub green: *mut ::std::os::raw::c_ushort,
    #[doc = " An array of value describing the response of the blue channel."]
    pub blue: *mut ::std::os::raw::c_ushort,
    #[doc = " The number of elements in each array."]
    pub size: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_GLFWgammaramp() {
    assert_eq!(
        ::std::mem::size_of::<GLFWgammaramp>(),
        32usize,
        concat!("Size of: ", stringify!(GLFWgammaramp))
    );
    assert_eq!(
        ::std::mem::align_of::<GLFWgammaramp>(),
        8usize,
        concat!("Alignment of ", stringify!(GLFWgammaramp))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GLFWgammaramp>())).red as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GLFWgammaramp),
            "::",
            stringify!(red)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GLFWgammaramp>())).green as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GLFWgammaramp),
            "::",
            stringify!(green)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GLFWgammaramp>())).blue as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(GLFWgammaramp),
            "::",
            stringify!(blue)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GLFWgammaramp>())).size as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(GLFWgammaramp),
            "::",
            stringify!(size)
        )
    );
}
#[doc = " @brief Image data."]
#[doc = ""]
#[doc = "  This describes a single 2D image.  See the documentation for each related"]
#[doc = "  function what the expected pixel format is."]
#[doc = ""]
#[doc = "  @sa @ref cursor_custom"]
#[doc = "  @sa @ref window_icon"]
#[doc = ""]
#[doc = "  @since Added in version 2.1."]
#[doc = "  @glfw3 Removed format and bytes-per-pixel members."]
#[doc = ""]
#[doc = "  @ingroup window"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GLFWimage {
    #[doc = " The width, in pixels, of this image."]
    pub width: ::std::os::raw::c_int,
    #[doc = " The height, in pixels, of this image."]
    pub height: ::std::os::raw::c_int,
    #[doc = " The pixel data of this image, arranged left-to-right, top-to-bottom."]
    pub pixels: *mut ::std::os::raw::c_uchar,
}
#[test]
fn bindgen_test_layout_GLFWimage() {
    assert_eq!(
        ::std::mem::size_of::<GLFWimage>(),
        16usize,
        concat!("Size of: ", stringify!(GLFWimage))
    );
    assert_eq!(
        ::std::mem::align_of::<GLFWimage>(),
        8usize,
        concat!("Alignment of ", stringify!(GLFWimage))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GLFWimage>())).width as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GLFWimage),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GLFWimage>())).height as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(GLFWimage),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GLFWimage>())).pixels as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(GLFWimage),
            "::",
            stringify!(pixels)
        )
    );
}
#[doc = " @brief Gamepad input state"]
#[doc = ""]
#[doc = "  This describes the input state of a gamepad."]
#[doc = ""]
#[doc = "  @sa @ref gamepad"]
#[doc = "  @sa @ref glfwGetGamepadState"]
#[doc = ""]
#[doc = "  @since Added in version 3.3."]
#[doc = ""]
#[doc = "  @ingroup input"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct GLFWgamepadstate {
    #[doc = " The states of each [gamepad button](@ref gamepad_buttons), `GLFW_PRESS`"]
    #[doc = "  or `GLFW_RELEASE`."]
    pub buttons: [::std::os::raw::c_uchar; 15usize],
    #[doc = " The states of each [gamepad axis](@ref gamepad_axes), in the range -1.0"]
    #[doc = "  to 1.0 inclusive."]
    pub axes: [f32; 6usize],
}
#[test]
fn bindgen_test_layout_GLFWgamepadstate() {
    assert_eq!(
        ::std::mem::size_of::<GLFWgamepadstate>(),
        40usize,
        concat!("Size of: ", stringify!(GLFWgamepadstate))
    );
    assert_eq!(
        ::std::mem::align_of::<GLFWgamepadstate>(),
        4usize,
        concat!("Alignment of ", stringify!(GLFWgamepadstate))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GLFWgamepadstate>())).buttons as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(GLFWgamepadstate),
            "::",
            stringify!(buttons)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<GLFWgamepadstate>())).axes as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(GLFWgamepadstate),
            "::",
            stringify!(axes)
        )
    );
}
extern "C" {
    #[doc = " @brief Initializes the GLFW library."]
    #[doc = ""]
    #[doc = "  This function initializes the GLFW library.  Before most GLFW functions can"]
    #[doc = "  be used, GLFW must be initialized, and before an application terminates GLFW"]
    #[doc = "  should be terminated in order to free any resources allocated during or"]
    #[doc = "  after initialization."]
    #[doc = ""]
    #[doc = "  If this function fails, it calls @ref glfwTerminate before returning.  If it"]
    #[doc = "  succeeds, you should call @ref glfwTerminate before the application exits."]
    #[doc = ""]
    #[doc = "  Additional calls to this function after successful initialization but before"]
    #[doc = "  termination will return `GLFW_TRUE` immediately."]
    #[doc = ""]
    #[doc = "  @return `GLFW_TRUE` if successful, or `GLFW_FALSE` if an"]
